Repository: LittleSixNine/PhotoTrail
Catalog: Sources/PhotoTrail/Localizable.xcstrings
Source language: en
Languages: es, ja, ko, pt_br, zh_hans, zh_hant

# 添加数字后缀
source: Add numeric suffix
es: Añadir sufijo numérico
ja: 数字の接尾辞を追加
ko: 숫자 접미사 추가
pt_br: Adicionar sufixo numérico
zh_hans: 添加数字后缀
zh_hant: 添加數字後綴

# 添加条件
source: Add condition
es: Añadir condición
ja: 条件を追加
ko: 조건 추가
pt_br: Adicionar condição
zh_hans: 添加条件
zh_hant: 添加條件

# 添加规则
source: Add rule
es: Añadir regla
ja: ルールを追加
ko: 규칙 추가
pt_br: Adicionar regra
zh_hans: 添加规则
zh_hant: 添加規則

# 源文件不可用、重复或为符号链接。
source: Source unavailable, duplicated or a symbolic link.
es: Origen no disponible, duplicado o enlace simbólico.
ja: 元ファイルが利用不可、重複、またはシンボリックリンクです。
ko: 원본을 사용할 수 없거나 중복 또는 심볼릭 링크입니다.
pt_br: Origem indisponível, duplicada ou link simbólico.
zh_hans: 源文件不可用、重复或为符号链接。
zh_hant: 源文件不可用、重複或為符號链接。

# 源文件已变化，请重新预览。
source: Source changed; refresh the preview.
es: El origen cambió; actualice la vista previa.
ja: 元ファイルが変わりました。再プレビューしてください。
ko: 원본이 변경되었습니다. 미리보기를 새로 고치세요.
pt_br: A origem mudou; atualize a prévia.
zh_hans: 源文件已变化，请重新预览。
zh_hant: 源文件已变化，請重新預覽。

# 满足任一条件
source: Match any condition
es: Cumplir cualquier condición
ja: いずれかの条件に一致
ko: 조건 하나 이상 충족
pt_br: Atender a qualquer condição
zh_hans: 满足任一条件
zh_hant: 滿足任一條件

# 满足全部条件
source: Match all conditions
es: Cumplir todas las condiciones
ja: すべての条件に一致
ko: 모든 조건 충족
pt_br: Atender a todas as condições
zh_hans: 满足全部条件
zh_hant: 滿足全部條件

# 照片注释
source: Photo comment
es: Comentario de foto
ja: 写真のコメント
ko: 사진 주석
pt_br: Comentário da foto
zh_hans: 照片注释
zh_hant: 照片注释

# 目录层数
source: Folder levels
es: Niveles de carpeta
ja: フォルダ階層数
ko: 폴더 단계 수
pt_br: Níveis de pasta
zh_hans: 目录层数
zh_hant: 目錄層數

# 目标文件名冲突
source: Target name conflict
es: Conflicto de nombre de destino
ja: 変更先の名前が競合
ko: 대상 이름 충돌
pt_br: Conflito de nome de destino
zh_hans: 目标文件名冲突
zh_hant: 目標文件名衝突

# 目标被占用，未覆盖文件。
source: Target occupied; no files overwritten.
es: Destino ocupado; no se sobrescribieron archivos.
ja: 変更先は使用中です。上書きしていません。
ko: 대상이 이미 있습니다. 파일을 덮어쓰지 않았습니다.
pt_br: Destino ocupado; nenhum arquivo sobrescrito.
zh_hans: 目标被占用，未覆盖文件。
zh_hant: 目標被占用，未覆盖文件。

# 确认重命名
source: Confirm rename
es: Confirmar renombrado
ja: 名前変更の確認
ko: 이름 변경 확인
pt_br: Confirmar renomeação
zh_hans: 确认重命名
zh_hant: 确認重命名

# 祖先层级（父目录为 0）
source: Ancestor level (parent is 0)
es: Nivel de ancestro (padre es 0)
ja: 上位階層（親を0とする）
ko: 상위 단계(부모는 0)
pt_br: Nível ancestral (pai é 0)
zh_hans: 祖先层级（父目录为 0）
zh_hant: 祖先層級（父目錄為 0）

# 移动后的目标位置
source: Destination after removal
es: Destino tras eliminar
ja: 移動後の位置
ko: 제거 후 대상 위치
pt_br: Destino após remoção
zh_hans: 移动后的目标位置
zh_hant: 移動後的目標位置

# 移除条件
source: Remove condition
es: Eliminar condición
ja: 条件を削除
ko: 조건 제거
pt_br: Remover condição
zh_hans: 移除条件
zh_hant: 移除條件

# 第 N 个匹配
source: Nth match
es: Coincidencia N
ja: N番目の一致
ko: N번째 일치
pt_br: Correspondência N
zh_hans: 第 N 个匹配
zh_hant: 第 N 個匹配

# 第一个匹配
source: First match
es: Primera coincidencia
ja: 最初の一致
ko: 첫 번째 일치
pt_br: Primeira correspondência
zh_hans: 第一个匹配
zh_hant: 第一個匹配

# 第一项保留无后缀名称
source: Keep first name without suffix
es: Primer nombre sin sufijo
ja: 最初の名前は接尾辞なし
ko: 첫 이름은 접미사 없이 유지
pt_br: Primeiro nome sem sufixo
zh_hans: 第一项保留无后缀名称
zh_hant: 第一项保留無後綴名稱

# 第几次匹配
source: Occurrence number
es: Número de coincidencia
ja: 一致番号
ko: 일치 번호
pt_br: Número da ocorrência
zh_hans: 第几次匹配
zh_hant: 第几次匹配

# 缺少拍摄时间
source: Missing shooting date
es: Falta fecha de captura
ja: 撮影日時がありません
ko: 촬영 시간 없음
pt_br: Data de captura ausente
zh_hans: 缺少拍摄时间
zh_hant: 缺少拍摄時間

# 缺少模板字段
source: Missing template field
es: Falta campo de plantilla
ja: テンプレート項目がありません
ko: 템플릿 필드 없음
pt_br: Campo do modelo ausente
zh_hans: 缺少模板字段
zh_hant: 缺少模板字段

# 被筛选排除
source: Excluded by filter
es: Excluido por filtro
ja: フィルターで除外
ko: 필터로 제외됨
pt_br: Excluído pelo filtro
zh_hans: 被筛选排除
zh_hant: 被篩選排除

# 要求整段匹配
source: Require full match
es: Exigir coincidencia completa
ja: 全体一致を要求
ko: 전체 일치 필요
pt_br: Exigir correspondência completa
zh_hans: 要求整段匹配
zh_hant: 要求整段匹配

# 规则 R%1$@ 参数无效，请检查输入。
source: Invalid parameters in rule R%1$@; check inputs.
es: Parámetros no válidos en regla R%1$@; revise entradas.
ja: ルールR%1$@の設定が無効です。入力を確認してください。
ko: 규칙 R%1$@의 매개변수가 잘못되었습니다. 입력을 확인하세요.
pt_br: Parâmetros inválidos na regra R%1$@; verifique as entradas.
zh_hans: 规则 R%1$@ 参数无效，请检查输入。
zh_hant: 規則 R%1$@ 参數無效，請检查输入。

# 请先保存或撤销元数据草稿，再执行重命名。
source: Save or discard metadata drafts before renaming.
es: Guarde o descarte borradores de metadatos antes de renombrar.
ja: 名前変更の前にメタデータの編集を保存または取り消してください。
ko: 이름 변경 전에 메타데이터 초안을 저장하거나 취소하세요.
pt_br: Salve ou descarte rascunhos de metadados antes de renomear.
zh_hans: 请先保存或撤销元数据草稿，再执行重命名。
zh_hant: 請先保存或撤销元數據草稿，再执行重命名。

# 起始值
source: Start at
es: Valor inicial
ja: 開始値
ko: 시작 값
pt_br: Valor inicial
zh_hans: 起始值
zh_hant: 起始值

# 运算值
source: Operand
es: Operando
ja: 演算値
ko: 연산 값
pt_br: Operando
zh_hans: 运算值
zh_hant: 運算值

# 选中照片及配对文件
source: Selected photos and paired files
es: Fotos seleccionadas y archivos pareados
ja: 選択した写真と対応ファイル
ko: 선택한 사진과 연결 파일
pt_br: Fotos selecionadas e arquivos pareados
zh_hans: 选中照片及配对文件
zh_hant: 選中照片及配對文件

# 部分文件需要恢复，请查看执行记录。
source: Some files need recovery; check rename history.
es: Algunos archivos requieren recuperación; revise el historial.
ja: 一部ファイルの復元が必要です。実行履歴を確認してください。
ko: 일부 파일 복원이 필요합니다. 실행 기록을 확인하세요.
pt_br: Alguns arquivos precisam de recuperação; verifique o histórico.
zh_hans: 部分文件需要恢复，请查看执行记录。
zh_hant: 部分文件需要恢複，請查看执行记錄。

# 重命名失败：%1$@
source: Rename failed: %1$@
es: Error al renombrar: %1$@
ja: 名前変更に失敗：%1$@
ko: 이름 변경 실패: %1$@
pt_br: Falha ao renomear: %1$@
zh_hans: 重命名失败：%1$@
zh_hant: 重命名失敗：%1$@

# 重命名规则
source: Rename rules
es: Reglas de renombrado
ja: 名前変更ルール
ko: 이름 변경 규칙
pt_br: Regras de renomeação
zh_hans: 重命名规则
zh_hant: 重命名規則

# 重命名预览
source: Rename preview
es: Vista previa de renombrado
ja: 名前変更プレビュー
ko: 이름 변경 미리보기
pt_br: Prévia de renomeação
zh_hans: 重命名预览
zh_hant: 重命名預覽

# 重新预览
source: Refresh preview
es: Actualizar vista previa
ja: 再プレビュー
ko: 미리보기 새로 고침
pt_br: Atualizar prévia
zh_hans: 重新预览
zh_hant: 重新預覽

# 阻止执行
source: Block execution
es: Bloquear ejecución
ja: 実行を阻止
ko: 실행 차단
pt_br: Bloquear execução
zh_hans: 阻止执行
zh_hant: 阻止执行

# 需要恢复
source: Recovery needed
es: Requiere recuperación
ja: 復元が必要
ko: 복원 필요
pt_br: Recuperação necessária
zh_hans: 需要恢复
zh_hant: 需要恢複

# 预设方案
source: Presets
es: Preajustes
ja: プリセット
ko: 프리셋
pt_br: Predefinições
zh_hans: 预设方案
zh_hant: 預設方案

# 预设格式或版本不受支持。
source: Unsupported preset format or version.
es: Formato o versión de preajuste no compatible.
ja: プリセットの形式またはバージョンが未対応です。
ko: 지원하지 않는 프리셋 형식 또는 버전입니다.
pt_br: Formato ou versão da predefinição não suportado.
zh_hans: 预设格式或版本不受支持。
zh_hant: 預設格式或版本不受支持。

# 高级设置
source: Advanced settings
es: Ajustes avanzados
ja: 詳細設定
ko: 고급 설정
pt_br: Configurações avançadas
zh_hans: 高级设置
zh_hant: 高級設置

# 高级选项统一在下方任务选项中设置。
source: Configure advanced options in task options below.
es: Configure opciones avanzadas en las opciones de tarea inferiores.
ja: 詳細設定は下の処理オプションで設定します。
ko: 아래 작업 옵션에서 고급 설정을 구성하세요.
pt_br: Configure opções avançadas nas opções da tarefa abaixo.
zh_hans: 高级选项统一在下方任务选项中设置。
zh_hant: 高級選项统一在下方任务選项中設置。

# 正在重命名文件，请勿关闭程序。
source: Renaming files; keep the app open.
es: Renombrando archivos; mantenga la aplicación abierta.
ja: 名前変更中です。アプリを閉じないでください。
ko: 파일 이름 변경 중입니다. 앱을 닫지 마세요.
pt_br: Renomeando arquivos; mantenha o aplicativo aberto.
zh_hans: 正在重命名文件，请勿关闭程序。
zh_hant: 正在重命名文件，請勿關闭程序。

# 仅控制后续规则，遇到下一筛选规则重新确定范围。
source: Applies to following rules until the next filter resets the scope.
es: Se aplica a reglas siguientes hasta que otro filtro restablezca el ámbito.
ja: 次のフィルターまでのルールに適用し、その後は範囲を再設定します。
ko: 다음 필터가 범위를 다시 정할 때까지 후속 규칙에 적용됩니다.
pt_br: Aplica-se às regras seguintes até o próximo filtro redefinir o escopo.
zh_hans: 仅控制后续规则，遇到下一筛选规则重新确定范围。
zh_hant: 僅控制後续規則，遇到下一篩選規則重新确定范围。

# 导入本地照片后设置规则，先核对预览，再执行改名。照片图库项目不支持文件改名。
source: Import local photos, configure rules and review before renaming. Photos library items cannot be renamed.
es: Importe fotos locales, configure reglas y revise antes de renombrar. No se renombra la fototeca.
ja: ローカル写真を読み込み、ルールとプレビューを確認して実行します。写真ライブラリ項目の名前変更には未対応です。
ko: 로컬 사진을 가져와 규칙과 미리보기를 확인하세요. 사진 보관함 항목은 이름 변경을 지원하지 않습니다.
pt_br: Importe fotos locais, configure regras e revise antes de renomear. Itens da fototeca não podem ser renomeados.
zh_hans: 导入本地照片后设置规则，先核对预览，再执行改名。照片图库项目不支持文件改名。
zh_hant: 導入本地照片後設置規則，先核對預覽，再执行改名。照片圖庫项目不支持文件改名。

# 将按预览重命名 %1$@ 个文件，包括列表中的配对文件。文件内容不改写；执行记录可用于恢复原名。
source: Rename %1$@ files as previewed, including listed paired files. Contents stay unchanged; history can restore original names.
es: Renombrar %1$@ archivos según la vista previa, incluidos los pareados. El contenido no cambia; el historial permite restaurar nombres.
ja: プレビューどおり、対応ファイルを含む%1$@個の名前を変更します。内容は変更せず、履歴から元の名前に戻せます。
ko: 연결 파일을 포함하여 미리보기의 파일 %1$@개를 변경합니다. 내용은 유지되며 기록으로 원래 이름을 복원할 수 있습니다.
pt_br: Renomear %1$@ arquivos conforme a prévia, incluindo pareados. O conteúdo não muda; o histórico permite restaurar nomes.
zh_hans: 将按预览重命名 %1$@ 个文件，包括列表中的配对文件。文件内容不改写；执行记录可用于恢复原名。
zh_hant: 将按預覽重命名 %1$@ 個文件，包括列表中的配對文件。文件內容不改寫；执行记錄可用于恢複原名。

# 恢复前核对文件身份、内容与原名占用；不会覆盖后来创建的文件。
source: Restore checks identity, contents and original name availability; it never overwrites later files.
es: Se comprueba identidad, contenido y disponibilidad del nombre original; no se sobrescriben archivos posteriores.
ja: 復元時にファイルの識別情報、内容、元の名前の使用状況を確認し、後から作成されたファイルは上書きしません。
ko: 복원 시 파일 식별 정보, 내용과 원래 이름 사용 여부를 확인하며 나중에 생성된 파일을 덮어쓰지 않습니다.
pt_br: A restauração verifica identidade, conteúdo e disponibilidade do nome original; não sobrescreve arquivos posteriores.
zh_hans: 恢复前核对文件身份、内容与原名占用；不会覆盖后来创建的文件。
zh_hant: 恢複前核對文件身份、內容與原名占用；不會覆盖後來创建的文件。

# 无时区的拍摄时间按记录的钟面时间使用，不推断拍摄地点时区。
source: Dates without a timezone use recorded wall-clock time; no shooting timezone is inferred.
es: Las fechas sin zona usan la hora registrada; no se infiere la zona de captura.
ja: タイムゾーンのない撮影日時は記録された時刻を使用し、撮影地のタイムゾーンを推測しません。
ko: 시간대 없는 촬영 시간은 기록된 시각을 사용하며 촬영지 시간대를 추정하지 않습니다.
pt_br: Datas sem fuso usam a hora registrada; o fuso da captura não é inferido.
zh_hans: 无时区的拍摄时间按记录的钟面时间使用，不推断拍摄地点时区。
zh_hant: 無時區的拍摄時間按记錄的鐘面時間使用，不推断拍摄地點時區。

# 每行新名称，或旧名与新名的 TSV
source: New name per line, or old/new name TSV
es: Nombre nuevo por línea o TSV de nombres antiguo/nuevo
ja: 1行1つの新しい名前、または旧名と新名のTSV
ko: 줄당 새 이름 또는 이전/새 이름 TSV
pt_br: Novo nome por linha ou TSV de nomes antigo/novo
zh_hans: 每行新名称，或旧名与新名的 TSV
zh_hant: 每行新名稱，或舊名與新名的 TSV

# 词汇大小写例外（每行一个）
source: Case exceptions (one per line)
es: Excepciones de mayúsculas (una por línea)
ja: 大小文字の例外（1行1つ）
ko: 대소문자 예외(줄당 하나)
pt_br: Exceções de maiúsculas (uma por linha)
zh_hans: 词汇大小写例外（每行一个）
zh_hant: 詞汇大小寫例外（每行一個）

# 标签模板，例如 <CameraModel>
source: Tag template, e.g. <CameraModel>
es: Plantilla de etiquetas, p. ej. <CameraModel>
ja: タグテンプレート（例：<CameraModel>）
ko: 태그 템플릿(예: <CameraModel>)
pt_br: Modelo de etiquetas, ex.: <CameraModel>
zh_hans: 标签模板，例如 <CameraModel>
zh_hant: 標籤模板，例如 <CameraModel>

# 文字
source: Text
es: texto
ja: テキスト
ko: 텍스트
pt_br: texto
zh_hans: 文字
zh_hant: 文字

# 日期与时间
source: Date and time
es: fecha y hora
ja: 日時
ko: 날짜와 시간
pt_br: data e hora
zh_hans: 日期与时间
zh_hant: 日期與時間

# 数字序列
source: Sequence numbers
es: números de secuencia
ja: 連番
ko: 일련 번호
pt_br: números sequenciais
zh_hans: 数字序列
zh_hant: 數字序列

# 罗马数字
source: Roman numerals
es: números romanos
ja: ローマ数字
ko: 로마 숫자
pt_br: números romanos
zh_hans: 罗马数字
zh_hant: 罗马數字

# 字母序列
source: Alphabetic sequence
es: secuencia alfabética
ja: アルファベット連番
ko: 알파벳 순서
pt_br: sequência alfabética
zh_hans: 字母序列
zh_hant: 字母序列

# 通用标签
source: Tags
es: etiquetas
ja: タグ
ko: 태그
pt_br: etiquetas
zh_hans: 通用标签
zh_hant: 通用標籤

# MP3/AAC 音乐信息
source: Music tags
es: etiquetas de música
ja: 音楽タグ
ko: 음악 태그
pt_br: etiquetas de música
zh_hans: MP3/AAC 音乐信息
zh_hant: MP3/AAC 音乐信息

# 图像尺寸
source: Image dimensions
es: dimensiones de imagen
ja: 画像寸法
ko: 이미지 크기
pt_br: dimensões da imagem
zh_hans: 图像尺寸
zh_hant: 圖像尺寸

# 父文件夹名称
source: Parent folder name
es: nombre de carpeta padre
ja: 親フォルダ名
ko: 상위 폴더 이름
pt_br: nome da pasta pai
zh_hans: 父文件夹名称
zh_hant: 父文件夾名稱

# 路径组成
source: Path components
es: componentes de ruta
ja: パス要素
ko: 경로 구성 요소
pt_br: componentes do caminho
zh_hans: 路径组成
zh_hant: 路徑組成

# 字符集合
source: Characters
es: Caracteres
ja: 文字集合
ko: 문자 집합
pt_br: Caracteres
zh_hans: 字符集合
zh_hant: 字符集合

# 字符位置与范围
source: Character positions and ranges
es: Posiciones y rangos
ja: 文字位置と範囲
ko: 문자 위치 및 범위
pt_br: Posições e intervalos
zh_hans: 字符位置与范围
zh_hant: 字符位置與范围

# 格式转换
source: Conversions
es: Conversiones
ja: 変換
ko: 변환
pt_br: Conversões
zh_hans: 格式转换
zh_hant: 格式轉換

# 截断
source: Truncation
es: Truncamiento
ja: 切り詰め
ko: 자르기
pt_br: Truncamento
zh_hans: 截断
zh_hant: 截断

# 高级与特殊
source: Advanced and special
es: Avanzado y especial
ja: 詳細と特殊
ko: 고급 및 특수
pt_br: Avançado e especial
zh_hans: 高级与特殊
zh_hant: 高級與特殊

# 前置文字
source: Add text to beginning
es: Añadir texto al inicio
ja: テキストを先頭に追加
ko: 텍스트 앞에 추가
pt_br: Adicionar texto ao início
zh_hans: 前置文字
zh_hant: 前置文字

# 后置文字
source: Add text to end
es: Añadir texto al final
ja: テキストを末尾に追加
ko: 텍스트 뒤에 추가
pt_br: Adicionar texto ao final
zh_hans: 后置文字
zh_hant: 後置文字

# 在已有文字前插入
source: Insert text in front of existing text
es: Insertar texto antes del texto
ja: テキストをテキストの前に挿入
ko: 텍스트 기준 텍스트 앞에 삽입
pt_br: Inserir texto antes do texto
zh_hans: 在已有文字前插入
zh_hant: 在已有文字前插入

# 在已有文字后插入
source: Insert text after existing text
es: Insertar texto después del texto
ja: テキストをテキストの後に挿入
ko: 텍스트 기준 텍스트 뒤에 삽입
pt_br: Inserir texto depois do texto
zh_hans: 在已有文字后插入
zh_hant: 在已有文字後插入

# 在指定位置插入
source: Insert text at position
es: Insertar texto en posición
ja: テキストを指定位置に挿入
ko: 텍스트 지정 위치에 삽입
pt_br: Inserir texto na posição
zh_hans: 在指定位置插入
zh_hant: 在指定位置插入

# 用日期时间替换
source: Rename to date/time
es: Renombrar con fecha y hora
ja: 日時で名前を置換
ko: 날짜와 시간(으)로 이름 지정
pt_br: Renomear com data e hora
zh_hans: 用日期时间替换
zh_hant: 用日期時間替換

# 前置日期时间
source: Add date/time to beginning
es: Añadir fecha y hora al inicio
ja: 日時を先頭に追加
ko: 날짜와 시간 앞에 추가
pt_br: Adicionar data e hora ao início
zh_hans: 前置日期时间
zh_hant: 前置日期時間

# 后置日期时间
source: Add date/time to end
es: Añadir fecha y hora al final
ja: 日時を末尾に追加
ko: 날짜와 시간 뒤에 추가
pt_br: Adicionar data e hora ao final
zh_hans: 后置日期时间
zh_hant: 後置日期時間

# 在已有文字前插入日期时间
source: Insert date/time in front of existing text
es: Insertar fecha y hora antes del texto
ja: 日時をテキストの前に挿入
ko: 날짜와 시간 기준 텍스트 앞에 삽입
pt_br: Inserir data e hora antes do texto
zh_hans: 在已有文字前插入日期时间
zh_hant: 在已有文字前插入日期時間

# 在已有文字后插入日期时间
source: Insert date/time after existing text
es: Insertar fecha y hora después del texto
ja: 日時をテキストの後に挿入
ko: 날짜와 시간 기준 텍스트 뒤에 삽입
pt_br: Inserir data e hora depois do texto
zh_hans: 在已有文字后插入日期时间
zh_hant: 在已有文字後插入日期時間

# 在指定位置插入日期时间
source: Insert date/time at position
es: Insertar fecha y hora en posición
ja: 日時を指定位置に挿入
ko: 날짜와 시간 지정 위치에 삽입
pt_br: Inserir data e hora na posição
zh_hans: 在指定位置插入日期时间
zh_hant: 在指定位置插入日期時間

# 生成编号名称列表
source: Produce sequence number list
es: Renombrar con números de secuencia
ja: 連番で名前を置換
ko: 일련 번호(으)로 이름 지정
pt_br: Renomear com números sequenciais
zh_hans: 生成编号名称列表
zh_hant: 生成编號名稱列表

# 前置数字序列
source: Add sequence number at beginning
es: Añadir números de secuencia al inicio
ja: 連番を先頭に追加
ko: 일련 번호 앞에 추가
pt_br: Adicionar números sequenciais ao início
zh_hans: 前置数字序列
zh_hant: 前置數字序列

# 后置数字序列
source: Add sequence number to end
es: Añadir números de secuencia al final
ja: 連番を末尾に追加
ko: 일련 번호 뒤에 추가
pt_br: Adicionar números sequenciais ao final
zh_hans: 后置数字序列
zh_hant: 後置數字序列

# 在已有文字前插入数字
source: Insert sequence number in front of existing text
es: Insertar números de secuencia antes del texto
ja: 連番をテキストの前に挿入
ko: 일련 번호 기준 텍스트 앞에 삽입
pt_br: Inserir números sequenciais antes do texto
zh_hans: 在已有文字前插入数字
zh_hant: 在已有文字前插入數字

# 在已有文字后插入数字
source: Insert sequence number after existing text
es: Insertar números de secuencia después del texto
ja: 連番をテキストの後に挿入
ko: 일련 번호 기준 텍스트 뒤에 삽입
pt_br: Inserir números sequenciais depois do texto
zh_hans: 在已有文字后插入数字
zh_hant: 在已有文字後插入數字

# 在指定位置插入数字
source: Insert sequence number at position
es: Insertar números de secuencia en posición
ja: 連番を指定位置に挿入
ko: 일련 번호 지정 위치에 삽입
pt_br: Inserir números sequenciais na posição
zh_hans: 在指定位置插入数字
zh_hant: 在指定位置插入數字

# 生成罗马数字名称列表
source: Produce roman numeral list
es: Renombrar con números romanos
ja: ローマ数字で名前を置換
ko: 로마 숫자(으)로 이름 지정
pt_br: Renomear com números romanos
zh_hans: 生成罗马数字名称列表
zh_hant: 生成罗马數字名稱列表

# 前置罗马数字
source: Add roman numeral at beginning
es: Añadir números romanos al inicio
ja: ローマ数字を先頭に追加
ko: 로마 숫자 앞에 추가
pt_br: Adicionar números romanos ao início
zh_hans: 前置罗马数字
zh_hant: 前置罗马數字

# 后置罗马数字
source: Add roman numeral to end
es: Añadir números romanos al final
ja: ローマ数字を末尾に追加
ko: 로마 숫자 뒤에 추가
pt_br: Adicionar números romanos ao final
zh_hans: 后置罗马数字
zh_hant: 後置罗马數字

# 在已有文字前插入罗马数字
source: Insert roman numeral in front of existing text
es: Insertar números romanos antes del texto
ja: ローマ数字をテキストの前に挿入
ko: 로마 숫자 기준 텍스트 앞에 삽입
pt_br: Inserir números romanos antes do texto
zh_hans: 在已有文字前插入罗马数字
zh_hant: 在已有文字前插入罗马數字

# 在已有文字后插入罗马数字
source: Insert roman numeral after existing text
es: Insertar números romanos después del texto
ja: ローマ数字をテキストの後に挿入
ko: 로마 숫자 기준 텍스트 뒤에 삽입
pt_br: Inserir números romanos depois do texto
zh_hans: 在已有文字后插入罗马数字
zh_hant: 在已有文字後插入罗马數字

# 在指定位置插入罗马数字
source: Insert roman numeral at position
es: Insertar números romanos en posición
ja: ローマ数字を指定位置に挿入
ko: 로마 숫자 지정 위치에 삽입
pt_br: Inserir números romanos na posição
zh_hans: 在指定位置插入罗马数字
zh_hant: 在指定位置插入罗马數字

# 生成字母名称列表
source: Produce alphabetical list
es: Renombrar con secuencia alfabética
ja: アルファベット連番で名前を置換
ko: 알파벳 순서(으)로 이름 지정
pt_br: Renomear com sequência alfabética
zh_hans: 生成字母名称列表
zh_hant: 生成字母名稱列表

# 前置字母序列
source: Add alphabetical sequence at beginning
es: Añadir secuencia alfabética al inicio
ja: アルファベット連番を先頭に追加
ko: 알파벳 순서 앞에 추가
pt_br: Adicionar sequência alfabética ao início
zh_hans: 前置字母序列
zh_hant: 前置字母序列

# 后置字母序列
source: Add alphabetical sequence to end
es: Añadir secuencia alfabética al final
ja: アルファベット連番を末尾に追加
ko: 알파벳 순서 뒤에 추가
pt_br: Adicionar sequência alfabética ao final
zh_hans: 后置字母序列
zh_hant: 後置字母序列

# 在已有文字前插入字母序列
source: Insert alphabetical sequence in front of existing text
es: Insertar secuencia alfabética antes del texto
ja: アルファベット連番をテキストの前に挿入
ko: 알파벳 순서 기준 텍스트 앞에 삽입
pt_br: Inserir sequência alfabética antes do texto
zh_hans: 在已有文字前插入字母序列
zh_hant: 在已有文字前插入字母序列

# 在已有文字后插入字母序列
source: Insert alphabetical sequence after existing text
es: Insertar secuencia alfabética después del texto
ja: アルファベット連番をテキストの後に挿入
ko: 알파벳 순서 기준 텍스트 뒤에 삽입
pt_br: Inserir sequência alfabética depois do texto
zh_hans: 在已有文字后插入字母序列
zh_hant: 在已有文字後插入字母序列

# 在指定位置插入字母序列
source: Insert alphabetical sequence at position
es: Insertar secuencia alfabética en posición
ja: アルファベット連番を指定位置に挿入
ko: 알파벳 순서 지정 위치에 삽입
pt_br: Inserir sequência alfabética na posição
zh_hans: 在指定位置插入字母序列
zh_hant: 在指定位置插入字母序列

# 用标签模板替换
source: Rename using tag(s)
es: Renombrar con etiquetas
ja: タグで名前を置換
ko: 태그(으)로 이름 지정
pt_br: Renomear com etiquetas
zh_hans: 用标签模板替换
zh_hant: 用標籤模板替換

# 前置标签模板
source: Add tag(s) to beginning
es: Añadir etiquetas al inicio
ja: タグを先頭に追加
ko: 태그 앞에 추가
pt_br: Adicionar etiquetas ao início
zh_hans: 前置标签模板
zh_hant: 前置標籤模板

# 后置标签模板
source: Add tag(s) to end
es: Añadir etiquetas al final
ja: タグを末尾に追加
ko: 태그 뒤에 추가
pt_br: Adicionar etiquetas ao final
zh_hans: 后置标签模板
zh_hant: 後置標籤模板

# 在指定位置插入标签模板
source: Add tag(s) at position
es: Insertar etiquetas en posición
ja: タグを指定位置に挿入
ko: 태그 지정 위치에 삽입
pt_br: Inserir etiquetas na posição
zh_hans: 在指定位置插入标签模板
zh_hant: 在指定位置插入標籤模板

# 在已有文字前插入标签模板
source: Insert tag(s) in front of existing text
es: Insertar etiquetas antes del texto
ja: タグをテキストの前に挿入
ko: 태그 기준 텍스트 앞에 삽입
pt_br: Inserir etiquetas antes do texto
zh_hans: 在已有文字前插入标签模板
zh_hant: 在已有文字前插入標籤模板

# 在已有文字后插入标签模板
source: Insert tag(s) after existing text
es: Insertar etiquetas después del texto
ja: タグをテキストの後に挿入
ko: 태그 기준 텍스트 뒤에 삽입
pt_br: Inserir etiquetas depois do texto
zh_hans: 在已有文字后插入标签模板
zh_hant: 在已有文字後插入標籤模板

# 用音乐标签替换
source: Rename music files using MP3/AAC tags
es: Renombrar con etiquetas de música
ja: 音楽タグで名前を置換
ko: 음악 태그(으)로 이름 지정
pt_br: Renomear com etiquetas de música
zh_hans: 用音乐标签替换
zh_hant: 用音乐標籤替換

# 后置音乐标签
source: Add MP3/AAC tags to end
es: Añadir etiquetas de música al final
ja: 音楽タグを末尾に追加
ko: 음악 태그 뒤에 추가
pt_br: Adicionar etiquetas de música ao final
zh_hans: 后置音乐标签
zh_hant: 後置音乐標籤

# 前置音乐标签
source: Add MP3/AAC tags to beginning
es: Añadir etiquetas de música al inicio
ja: 音楽タグを先頭に追加
ko: 음악 태그 앞에 추가
pt_br: Adicionar etiquetas de música ao início
zh_hans: 前置音乐标签
zh_hant: 前置音乐標籤

# 在已有文字前插入音乐标签
source: Insert MP3/AAC tags in front of existing text
es: Insertar etiquetas de música antes del texto
ja: 音楽タグをテキストの前に挿入
ko: 음악 태그 기준 텍스트 앞에 삽입
pt_br: Inserir etiquetas de música antes do texto
zh_hans: 在已有文字前插入音乐标签
zh_hant: 在已有文字前插入音乐標籤

# 在已有文字后插入音乐标签
source: Insert MP3/AAC tags after existing text
es: Insertar etiquetas de música después del texto
ja: 音楽タグをテキストの後に挿入
ko: 음악 태그 기준 텍스트 뒤에 삽입
pt_br: Inserir etiquetas de música depois do texto
zh_hans: 在已有文字后插入音乐标签
zh_hant: 在已有文字後插入音乐標籤

# 在指定位置插入音乐标签
source: Insert MP3/AAC tags at position
es: Insertar etiquetas de música en posición
ja: 音楽タグを指定位置に挿入
ko: 음악 태그 지정 위치에 삽입
pt_br: Inserir etiquetas de música na posição
zh_hans: 在指定位置插入音乐标签
zh_hant: 在指定位置插入音乐標籤

# 后置图像尺寸
source: Add image dimensions to end
es: Añadir dimensiones de imagen al final
ja: 画像寸法を末尾に追加
ko: 이미지 크기 뒤에 추가
pt_br: Adicionar dimensões da imagem ao final
zh_hans: 后置图像尺寸
zh_hant: 後置圖像尺寸

# 前置图像尺寸
source: Add image dimensions to beginning
es: Añadir dimensiones de imagen al inicio
ja: 画像寸法を先頭に追加
ko: 이미지 크기 앞에 추가
pt_br: Adicionar dimensões da imagem ao início
zh_hans: 前置图像尺寸
zh_hant: 前置圖像尺寸

# 用图像尺寸替换
source: Rename to image dimensions
es: Renombrar con dimensiones de imagen
ja: 画像寸法で名前を置換
ko: 이미지 크기(으)로 이름 지정
pt_br: Renomear com dimensões da imagem
zh_hans: 用图像尺寸替换
zh_hant: 用圖像尺寸替換

# 在已有文字前插入尺寸
source: Insert image dimensions in front of existing text
es: Insertar dimensiones de imagen antes del texto
ja: 画像寸法をテキストの前に挿入
ko: 이미지 크기 기준 텍스트 앞에 삽입
pt_br: Inserir dimensões da imagem antes do texto
zh_hans: 在已有文字前插入尺寸
zh_hant: 在已有文字前插入尺寸

# 在已有文字后插入尺寸
source: Insert Image dimensions after existing text
es: Insertar dimensiones de imagen después del texto
ja: 画像寸法をテキストの後に挿入
ko: 이미지 크기 기준 텍스트 뒤에 삽입
pt_br: Inserir dimensões da imagem depois do texto
zh_hans: 在已有文字后插入尺寸
zh_hant: 在已有文字後插入尺寸

# 在指定位置插入尺寸
source: Insert image dimensions at position
es: Insertar dimensiones de imagen en posición
ja: 画像寸法を指定位置に挿入
ko: 이미지 크기 지정 위치에 삽입
pt_br: Inserir dimensões da imagem na posição
zh_hans: 在指定位置插入尺寸
zh_hant: 在指定位置插入尺寸

# 前置父目录名
source: Add folder name to beginning
es: Añadir nombre de carpeta padre al inicio
ja: 親フォルダ名を先頭に追加
ko: 상위 폴더 이름 앞에 추가
pt_br: Adicionar nome da pasta pai ao início
zh_hans: 前置父目录名
zh_hant: 前置父目錄名

# 后置父目录名
source: Add folder name to end
es: Añadir nombre de carpeta padre al final
ja: 親フォルダ名を末尾に追加
ko: 상위 폴더 이름 뒤에 추가
pt_br: Adicionar nome da pasta pai ao final
zh_hans: 后置父目录名
zh_hant: 後置父目錄名

# 在已有文字前插入父目录名
source: Insert folder name in front of existing text
es: Insertar nombre de carpeta padre antes del texto
ja: 親フォルダ名をテキストの前に挿入
ko: 상위 폴더 이름 기준 텍스트 앞에 삽입
pt_br: Inserir nome da pasta pai antes do texto
zh_hans: 在已有文字前插入父目录名
zh_hant: 在已有文字前插入父目錄名

# 在已有文字后插入父目录名
source: Insert folder name after existing text
es: Insertar nombre de carpeta padre después del texto
ja: 親フォルダ名をテキストの後に挿入
ko: 상위 폴더 이름 기준 텍스트 뒤에 삽입
pt_br: Inserir nome da pasta pai depois do texto
zh_hans: 在已有文字后插入父目录名
zh_hant: 在已有文字後插入父目錄名

# 在指定位置插入父目录名
source: Insert folder name at position
es: Insertar nombre de carpeta padre en posición
ja: 親フォルダ名を指定位置に挿入
ko: 상위 폴더 이름 지정 위치에 삽입
pt_br: Inserir nome da pasta pai na posição
zh_hans: 在指定位置插入父目录名
zh_hant: 在指定位置插入父目錄名
